// Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
[1,0,1,1,0,1,0,0]

Console.WriteLine("Эта программа выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке");

int[] array = new int[8];
int len = array.Length;
int index = 0;



