// Напишите программу, которая на вход принимает чсисло и выдает его квадрат (число умноженное на само себя)
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49


int num = 4;
int square = num * num;
Console.WriteLine(square);
