// Напишите программу, которая на вход принимает одно число (N), а на выходе показыает все целые числа в промежутке от -N до N 
// 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
// 2 -> "-2, -1, 0, 1, 2"

Console.WriteLine("Эта программа на вход принимает одно число (N), а на выходе показыает все целые числа в промежутке от -N до N");
Console.Write("Введите число: ");

int num = Convert.ToInt32(Console.ReadLine());
int i = Convert.ToInt32(Console.ReadLine());
if (int i = -num; i <= num; i ++);
{
    Console.Write($"{i} ");
}
else
{
    Console.WriteLine("Это не число");
}

